import { Injectable } from '@nestjs/common';
@Injectable()
export class AppService {
  getHello(): string {
    const data = [
      
      //MON
      {
        startTime: '2023-05-29 08:00:00.919982',
        endTime: '2023-05-29 11:00:00.919982',
        subject: 'วิชาเทคโนโลยียานยนต์',
        color: '0xFF7EC1DA',
      },
//       {
//         startTime: '2023-05-29 13:00:00.919982',
//         endTime: '2023-05-29 16:00:00.919982',
//         subject: 'วิชาเทคโนโลยีไฟฟ้า และระบบควบคุมอัตโนมัติ',
//         color: '0xFF7EC1DA',
//       },
//       //TUR
//       {
//         startTime: '2023-05-30 09:30:00.919982',
//         endTime: '2023-05-30 11:30:00.919982',
//         subject: 'วิชาการจัดการโลจิสติกส์',
//         color: '0xFF7EC1DA',
//       },
//       {
//         startTime: '2023-05-30 15:30:00.919982',
//         endTime: '2023-05-30 17:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //WED
//       {
//         startTime: '2023-05-31 08:30:00.919982',
//         endTime: '2023-05-31 11:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //THU
//       {
//         startTime: '2023-06-01 08:30:00.919982',
//         endTime: '2023-06-01 11:30:00.919982',
//         subject: 'วิชาวิศวกรรมพลังงาน',
//         color: '0xFF7EC1DA',
//       },
//       //FRI
//       {
//         startTime: '2023-06-02 13:00:00.919982',
//         endTime: '2023-06-02 18:00:00.919982',
//         subject: 'วิชาฟิสิกส์',
//         color: '0xFF7EC1DA',
//       },
      
//       ////      
      
      
//       //MON
//       {
//         startTime: '2023-06-05 08:00:00.919982',
//         endTime: '2023-06-05 11:00:00.919982',
//         subject: 'วิชาเทคโนโลยียานยนต์',
//         color: '0xFF7EC1DA',
//       },
//       {
//         startTime: '2023-06-05 13:00:00.919982',
//         endTime: '2023-06-05 16:00:00.919982',
//         subject: 'วิชาเทคโนโลยีไฟฟ้า และระบบควบคุมอัตโนมัติ',
//         color: '0xFF7EC1DA',
//       },
//       //TUR
//       {
//         startTime: '2023-06-06 09:30:00.919982',
//         endTime: '2023-06-06 11:30:00.919982',
//         subject: 'วิชาการจัดการโลจิสติกส์',
//         color: '0xFF7EC1DA',
//       },
//       {
//         startTime: '2023-06-06 15:30:00.919982',
//         endTime: '2023-06-06 17:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //WED
//       {
//         startTime: '2023-06-07 08:30:00.919982',
//         endTime: '2023-06-07 11:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //THU
//       {
//         startTime: '2023-06-08 08:30:00.919982',
//         endTime: '2023-06-08 11:30:00.919982',
//         subject: 'วิชาวิศวกรรมพลังงาน',
//         color: '0xFF7EC1DA',
//       },
//       //FRI
//       {
//         startTime: '2023-06-09 13:00:00.919982',
//         endTime: '2023-06-09 18:00:00.919982',
//         subject: 'วิชาฟิสิกส์',
//         color: '0xFF7EC1DA',
//       },
      
      
//             ////      
      
      
//       //MON
//       {
//         startTime: '2023-06-12 08:00:00.919982',
//         endTime: '2023-06-12 11:00:00.919982',
//         subject: 'วิชาเทคโนโลยียานยนต์',
//         color: '0xFF7EC1DA',
//       },
//       {
//         startTime: '2023-06-12 13:00:00.919982',
//         endTime: '2023-06-12 16:00:00.919982',
//         subject: 'วิชาเทคโนโลยีไฟฟ้า และระบบควบคุมอัตโนมัติ',
//         color: '0xFF7EC1DA',
//       },
//       //TUR
//       {
//         startTime: '2023-06-13 09:30:00.919982',
//         endTime: '2023-06-13 11:30:00.919982',
//         subject: 'วิชาการจัดการโลจิสติกส์',
//         color: '0xFF7EC1DA',
//       },
//       {
//         startTime: '2023-06-13 15:30:00.919982',
//         endTime: '2023-06-13 17:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //WED
//       {
//         startTime: '2023-06-14 08:30:00.919982',
//         endTime: '2023-06-14 11:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //THU
//       {
//         startTime: '2023-06-15 08:30:00.919982',
//         endTime: '2023-06-15 11:30:00.919982',
//         subject: 'วิชาวิศวกรรมพลังงาน',
//         color: '0xFF7EC1DA',
//       },
//       //FRI
//       {
//         startTime: '2023-06-16 13:00:00.919982',
//         endTime: '2023-06-16 18:00:00.919982',
//         subject: 'วิชาฟิสิกส์',
//         color: '0xFF7EC1DA',
//       },
      
//                   ////      
      
      
//       //MON
//       {
//         startTime: '2023-06-19 08:00:00.919982',
//         endTime: '2023-06-19 11:00:00.919982',
//         subject: 'วิชาเทคโนโลยียานยนต์',
//         color: '0xFF7EC1DA',
//       },
//       {
//         startTime: '2023-06-19 13:00:00.919982',
//         endTime: '2023-06-19 16:00:00.919982',
//         subject: 'วิชาเทคโนโลยีไฟฟ้า และระบบควบคุมอัตโนมัติ',
//         color: '0xFF7EC1DA',
//       },
//       //TUR
//       {
//         startTime: '2023-06-20 09:30:00.919982',
//         endTime: '2023-06-20 11:30:00.919982',
//         subject: 'วิชาการจัดการโลจิสติกส์',
//         color: '0xFF7EC1DA',
//       },
//       {
//         startTime: '2023-06-20 15:30:00.919982',
//         endTime: '2023-06-20 17:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //WED
//       {
//         startTime: '2023-06-21 08:30:00.919982',
//         endTime: '2023-06-21 11:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //THU
//       {
//         startTime: '2023-06-22 08:30:00.919982',
//         endTime: '2023-06-22 11:30:00.919982',
//         subject: 'วิชาวิศวกรรมพลังงาน',
//         color: '0xFF7EC1DA',
//       },
//       //FRI
//       {
//         startTime: '2023-06-23 13:00:00.919982',
//         endTime: '2023-06-23 18:00:00.919982',
//         subject: 'วิชาฟิสิกส์',
//         color: '0xFF7EC1DA',
//       },
      
//                   ////      
      
      
//       //MON
//       {
//         startTime: '2023-06-26 08:00:00.919982',
//         endTime: '2023-06-26 11:00:00.919982',
//         subject: 'วิชาเทคโนโลยียานยนต์',
//         color: '0xFF7EC1DA',
//       },
//       {
//         startTime: '2023-06-26 13:00:00.919982',
//         endTime: '2023-06-26 16:00:00.919982',
//         subject: 'วิชาเทคโนโลยีไฟฟ้า และระบบควบคุมอัตโนมัติ',
//         color: '0xFF7EC1DA',
//       },
//       //TUR
//       {
//         startTime: '2023-26-27 09:30:00.919982',
//         endTime: '2023-06-27 11:30:00.919982',
//         subject: 'วิชาการจัดการโลจิสติกส์',
//         color: '0xFF7EC1DA',
//       },
//       {
//         startTime: '2023-06-27 15:30:00.919982',
//         endTime: '2023-06-27 17:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //WED
//       {
//         startTime: '2023-06-28 08:30:00.919982',
//         endTime: '2023-06-28 11:30:00.919982',
//         subject: 'วิชาเทคโนโลยีคอมพิวเตอร์',
//         color: '0xFF7EC1DA',
//       },
//       //THU
//       {
//         startTime: '2023-06-29 08:30:00.919982',
//         endTime: '2023-06-29 11:30:00.919982',
//         subject: 'วิชาวิศวกรรมพลังงาน',
//         color: '0xFF7EC1DA',
//       },
//       //FRI
//       {
//         startTime: '2023-06-30 13:00:00.919982',
//         endTime: '2023-06-30 18:00:00.919982',
//         subject: 'วิชาฟิสิกส์',
//         color: '0xFF7EC1DA',
//       },
    ];
    
    

    const jsonString = JSON.stringify(data);

    return jsonString;
  }
}

